## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 2 to change, 4 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cron_2am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_2am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 2am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-day-at-2am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 7 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_rule.cron_3am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_3am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 3am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-day-at-3am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_archive_form_responses_lambda_every_day" {
      + arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Archiver"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-3am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day must be replaced
-/+ resource "aws_cloudwatch_event_target" "run_dead_letter_queue_consumer_lambda_every_day" {
      ~ id             = "every-day-at-4am-terraform-20220719162223551700000001" -> (known after apply)
      ~ rule           = "every-day-at-4am" -> "every-day-at-2am" # forces replacement
      ~ target_id      = "terraform-20220719162223551700000001" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_dynamodb will be updated in-place
  ~ resource "aws_iam_policy" "lambda_dynamodb" {
        id          = "arn:aws:iam::687401027353:policy/lambda_dynamobdb"
        name        = "lambda_dynamobdb"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/stream/2023-02-22T20:20:48.383",
                            "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/index/*",
                            # (2 unchanged elements hidden)
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.vault_updated_item_stream will be destroyed
  # (because aws_lambda_event_source_mapping.vault_updated_item_stream is not in configuration)
  - resource "aws_lambda_event_source_mapping" "vault_updated_item_stream" {
      - batch_size                         = 25 -> null
      - bisect_batch_on_function_error     = false -> null
      - enabled                            = true -> null
      - event_source_arn                   = "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/stream/2023-02-22T20:20:48.383" -> null
      - function_arn                       = "arn:aws:lambda:ca-central-1:687401027353:function:Archiver" -> null
      - function_name                      = "arn:aws:lambda:ca-central-1:687401027353:function:Archiver" -> null
      - function_response_types            = [] -> null
      - id                                 = "eb9aa51b-5dda-499e-ba8b-157ae848db9c" -> null
      - last_modified                      = "2023-02-22T20:22:00Z" -> null
      - last_processing_result             = "No records processed" -> null
      - maximum_batching_window_in_seconds = 0 -> null
      - maximum_record_age_in_seconds      = -1 -> null
      - maximum_retry_attempts             = 3 -> null
      - parallelization_factor             = 1 -> null
      - queues                             = [] -> null
      - starting_position                  = "LATEST" -> null
      - state                              = "Enabled" -> null
      - state_transition_reason            = "User action" -> null
      - topics                             = [] -> null
      - tumbling_window_in_seconds         = 0 -> null
      - uuid                               = "eb9aa51b-5dda-499e-ba8b-157ae848db9c" -> null

      - destination_config {
          - on_failure {}
        }

      - filter_criteria {
          - filter {
              - pattern = jsonencode(
                    {
                      - dynamodb = {
                          - NewImage = {
                              - Retrieved = {
                                  - N = [
                                      - "1",
                                    ]
                                }
                            }
                        }
                    }
                ) -> null
            }
        }
    }

  # aws_lambda_function.archiver will be updated in-place
  ~ resource "aws_lambda_function" "archiver" {
        id                             = "Archiver"
      ~ last_modified                  = "2023-02-06T13:41:04.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages:3",
        ] -> (known after apply)
      ~ source_code_hash               = "PydWxaEPnnPxvtxls5WnI5knw5/TGu7GBHAwnVJ3VQ4=" -> "6Bv1nuC+5CabTbjjnZo7yO7Amc2DkwMMgNPZLhC92uU="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "VAULT_FILE_STORAGE_S3_BUCKET" = "forms-staging-vault-file-storage"
                # (4 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_layer_version.archiver_lib must be replaced
-/+ resource "aws_lambda_layer_version" "archiver_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages:3" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-02-06T13:41:03.600+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "FC08wL1g+0yo6RCL2kUefvGUAvQfynfPE6dScQ7mJYc=" -> "6X9YTCh1fJcAmtVROb+by3KyUbS1M+vy1s41EGkkITs=" # forces replacement
      ~ source_code_size            = 4083769 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_archive_form_responses_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Archiver"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda" {
      ~ id            = "AllowExecutionFromCloudWatch" -> (known after apply)
      ~ source_arn    = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-4am" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 4 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.reliability_file_storage,
  on s3.tf line 4, in resource "aws_s3_bucket" "reliability_file_storage":
   4: resource "aws_s3_bucket" "reliability_file_storage" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 17 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_cloudwatch_metric_alarm.scan_files_api_error[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_role.s3_scan_object"]

23 tests, 17 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
